package dsy.model.ml
/*
        监督学习
           label属于离散值使用分类算法
                   分类算法属于最多的算法,比如:
                   1. 决策树分类算法
                   2. 朴素贝叶斯算法,适合构建文本数据特征分类,比如垃圾邮件,情感分析
                   3. 逻辑回归算法
                   4. 线性支持向量机分类算法
                   5. 神经网络相关分类算法，比如多层感知肌算法 --> 深度学习算法
                   6. 集成融合算法:随机森林算法(RF算法)、梯度提升树(GBT算法)
           label属于连续值使用回归算法
                   线性回归算法(代价函数j(θ)求最小)
                     -最小二乘法（矩阵相乘,交替最小二乘法(ALS):多用于推荐系统）RDD
                     -梯度下降法(求导微积分)RDD
                     -牛顿迭代法(泰勒公式)DataFrame
 */
class learn {

}
